Repository: KalpeshKalsariya/CommonBaseCode
Catalog: CommonBaseCode/HelperClass/*.lproj/Localizable.strings
Languages: es

# server_error_bad_request_400
source: The server cannot understand the request.
es: El servidor no puede entender la solicitud.

# server_error_unauthorized_401
source: Authentication is required.
es: Se requiere autenticacion.

# server_error_forbidden_403
source: You don't have permission to access the requested resource.
es: No tienes permiso para acceder al recurso solicitado.

# server_error_not_found_404
source: The requested resource could not be found on the server.
es: El recurso solicitado no se pudo encontrar en el servidor.

# server_error_method_not_allowed_405
source: The requested HTTP method is not allowed for the given resource.
es: El método HTTP solicitado no está permitido para el recurso dado.

# server_error_internal_server_500
source: The server encountered an unexpected condition.
es: El servidor encontró una condición inesperada.

# server_error_not_implemented_501
source: The server does not support the functionality required to fulfill the request.
es: El servidor no admite la funcionalidad necesaria para cumplir con la solicitud.

# server_error_bad_gateway_502
source: The server, while acting as a gateway or proxy, received an invalid response from the upstream server.
es: El servidor, mientras actuaba como puerta de enlace o proxy, recibió una respuesta no válida del servidor ascendente.

# server_error_service_unavailable_503
source: The server is temporarily unable to handle the request due to maintenance or overloading.
es: El servidor no puede procesar temporalmente la solicitud debido a mantenimiento o sobrecarga.

# server_error_gateway_timeout_504
source: The server, while acting as a gateway or proxy, did not receive a timely response from the upstream server.
es: El servidor, mientras actuaba como puerta de enlace o proxy, no recibió una respuesta oportuna del servidor ascendente.

# server_error_unknown
source: An unexpected error occurred.
es: Se produjo un error inesperado.

# error_internet_connection
source: Your request could not be processed because your device is not connected to the internet.
es: Su solicitud no pudo ser procesada porque su dispositivo no está conectado a Internet.

# confirmation_message_logout
source: Are you sure you want to logout?
es: ¿Estás segura de que quieres cerrar sesión?

# confirmation_message_clear_data
source: Are you sure you want clear data item?
es: ¿Está seguro de que desea un elemento de datos claro?

# button_title_yes
source: Yes
es: Sí

# button_title_ok
source: Ok
es: De acuerdo

# button_title_cancel
source: Cancel
es: Cancelar

# static_text_label_required
source: Required
es: Requerida

# static_text_label_no_data_found
source: No Data Found.
es: Datos no encontrados.

# static_text_label_password_recovery
source: We will send a password recovery email to your email.
es: Le enviaremos un correo electrónico de recuperación de contraseña a su correo electrónico.

# static_text_label_out_of_stock
source: out of stock
es: Agotado

# static_text_label_in_stock
source: in stock
es: en stock

# empty_validate_email
source: Please enter an email address.
es: Por favor introduzca su correo electrónico.

# invalid_email
source: Please enter a valid email address.
es: Por favor introduzca un correo electrónico válido.

# short_email
source: Your email must be at least 5 characters long.
es: Su correo electrónico debe tener al menos 5 caracteres.

# long_email
source: Your email must be no more than 254 characters long.
es: Su correo electrónico no debe tener más de 254 caracteres.

# required_email
source: Email address is required.
es: La dirección de correo electrónico es obligatoria.

# empty_validate_password
source: Please enter a password.
es: Por favor introduzca una contraseña.

# short_password
source: Your password must be at least 8 characters long.
es: Su contraseña debe tener al menos 8 caracteres.

# long_password
source: Your password must be no more than 100 characters long.
es: Su contraseña no debe tener más de 100 caracteres.

# error_invalid_password
source: Your password must contain at least one number, one uppercase letter, one lowercase letter, and one special character.
es: Su contraseña debe contener al menos un número, una letra mayúscula, una letra minúscula y un carácter especial.

# required_password
source: Password is required.
es: La contraseña es obligatoria.

# empty_username
source: Please enter a username.
es: Por favor introduzca un nombre de usuario.

# short_username
source: Your username must be at least 3 characters long.
es: El nombre de usuario debe tener al menos 3 caracteres.

# long_username
source: Your username must be no more than 30 characters long.
es: El nombre de usuario no debe tener más de 30 caracteres.

# invalid_username
source: Your username can only contain alphanumeric characters and underscores.
es: El nombre de usuario solo puede contener caracteres alfanuméricos y guiones bajos.

# required_username
source: Username is required.
es: El nombre de usuario es obligatorio.

# empty_fullname
source: Please enter your full name.
es: Por favor introduzca su nombre completo.

# short_fullname
source: Your full name must be at least 2 characters long.
es: El nombre completo debe tener al menos 2 caracteres.

# long_fullname
source: Your full name must be no more than 50 characters long.
es: El nombre completo no debe tener más de 50 caracteres.

# invalid_fullname
source: Please enter a valid name.
es: Por favor introduzca un nombre válido.

# required_fullname
source: Fullname is required.
es: El nombre completo es obligatorio.

# empty_phone
source: Please enter a phone number.
es: Por favor introduzca un número de teléfono.

# invalid_phone
source: Please enter a valid phone number.
es: Por favor introduzca un número de teléfono válido.

# short_phone
source: Your phone number must be at least 10 digits long.
es: El número de teléfono debe tener al menos 10 dígitos.

# long_phone
source: Your phone number must be no more than 15 digits long.
es: El número de teléfono no debe tener más de 15 dígitos.

# required_phone
source: Phone number is required.
es: El número de teléfono es obligatorio.

# empty_address
source: Please enter an address.
es: Por favor introduzca una dirección.

# short_address
source: Your address must be at least 5 characters long.
es: La dirección debe tener al menos 5 caracteres.

# long_address
source: Your address must be no more than 100 characters long.
es: La dirección no debe tener más de 100 caracteres.

# required_address
source: Address is required.
es: La dirección es obligatoria.

# empty_dob
source: Please enter a date of birth.
es: Por favor introduzca su fecha de nacimiento.

# invalid_dob
source: Please enter a valid date of birth.
es: Por favor introduzca una fecha de nacimiento válida.

# required_dob
source: Date of birth is required.
es: La fecha de nacimiento es obligatoria.

# empty_credit_card
source: Please enter a credit card number.
es: Por favor introduzca un número de tarjeta de crédito.

# invalid_credit_card
source: Please enter a valid credit card number.
es: Por favor introduzca un número de tarjeta de crédito válido.

# required_credit_card
source: Credit card is required.
es: La tarjeta de crédito es obligatoria.

# empty_expiry_date
source: Please enter an expiry date.
es: Por favor introduzca una fecha de vencimiento.

# invalid_expiry_date
source: Please enter a valid expiry date.
es: Por favor introduzca una fecha de vencimiento válida.

# expired_expiry_date
source: Your credit card has expired.
es: Su tarjeta de crédito ha expirado.

# required_expiry_date
source: Credit card expiry date is required.
es: La fecha de vencimiento de la tarjeta de crédito es obligatoria.

# empty_cvv
source: Please enter the CVV of your credit card.
es: Por favor introduzca el CVV de su tarjeta de crédito.

# invalid_cvv
source: Please enter a valid CVV.
es: Por favor introduzca un CVV válido.

# required_cvv
source: CVV number is required.
es: El número CVV es obligatorio.

# empty_security_question
source: Please select a security question.
es: Por favor seleccione una pregunta de seguridad.

# empty_security_answer
source: Please provide an answer to your security question.
es: Por favor proporcione una respuesta a su pregunta de seguridad.

# empty_location
source: Please enter your location.
es: Por favor introduzca su ubicación.

# short_location
source: Your location must be at least 2 characters long.
es: La ubicación debe tener al menos 2 caracteres.

# long_location
source: Your location must be no more than 50 characters long.
es: La ubicación no debe tener más de 50 caracteres.

# required_location
source: Location is required.
es: La ubicación es obligatoria.

# empty_select_location
source: Please select your location.
es: Por favor seleccione su ubicación.

# invalid_select_location
source: Please select a valid location.
es: Por favor seleccione una ubicación válida.

# required_select_location
source: Location selection is required.
es: La selección de ubicación es obligatoria.

# empty_upload_profile_picture
source: Please upload your profile picture.
es: Por favor cargue su foto de perfil.

# invalid_upload_profile_picture
source: Please upload a valid profile picture file.
es: Por favor cargue un archivo de imagen válido.

# format_upload_profile_picture
source: Your profile picture must be a .jpg, .jpeg, .png, or .gif file.
es: Su foto de perfil debe estar en formato .jpg, .jpeg, .png o .gif.

# size_upload_profile_picture
source: Your profile picture file size must be no more than 5MB.
es: El tamaño del archivo de la foto de perfil no debe superar los 5 MB.

# required_upload_profile_picture
source: Profile picture is required.
es: La foto de perfil es obligatoria.

# empty_select_profile_picture
source: Please select your profile picture.
es: Por favor seleccione su foto de perfil.

# invalid_select_profile_picture
source: Please select a valid profile picture.
es: Por favor seleccione una foto de perfil válida.

# required_select_profile_picture
source: Profile picture selection is required.
es: La selección de la foto de perfil es obligatoria.

# empty_age
source: Please enter your age.
es: Por favor introduzca su edad.

# invalid_age
source: Please enter a valid age.
es: Por favor introduzca una edad válida.

# low_age
source: Your age must be at least 18.
es: Debe tener al menos 18 años.

# high_age
source: Your age must be no more than 100.
es: La edad no debe ser superior a 100 años.

# required_age
source: Age is required.
es: La edad es obligatoria.

# empty_select_age
source: Please select your age.
es: Por favor seleccione su edad.

# invalid_select_age
source: Please select a valid age.
es: Por favor seleccione una edad válida.

# required_select_age
source: Age selection is required.
es: La selección de edad es obligatoria.

# empty_gender
source: Please select your gender.
es: Por favor seleccione su género.

# invalid_gender
source: Please select a valid gender.
es: Por favor seleccione un género válido.

# required_gender
source: Gender selection is required.
es: La selección de género es obligatoria.

# empty_retype_password
source: Please re-enter your password.
es: Por favor vuelva a introducir su contraseña.

# short_retype_password
source: Your re-entered password must be at least 8 characters long.
es: La contraseña reintroducida debe tener al menos 8 caracteres.

# long_retype_password
source: Your re-entered password must be no more than 50 characters long.
es: La contraseña reintroducida no debe tener más de 50 caracteres.

# required_retype_password
source: Re-enter password is required.
es: Es obligatorio volver a introducir la contraseña.

# empty_comment
source: Please enter your comment.
es: Por favor introduzca su comentario.

# short_comment
source: Your comment must be at least 2 characters long.
es: El comentario debe tener al menos 2 caracteres.

# long_comment
source: Your comment must be no more than 500 characters long.
es: El comentario no debe tener más de 500 caracteres.

# required_comment
source: Comment is required.
es: El comentario es obligatorio.

# empty_description
source: Please enter the description.
es: Por favor introduzca la descripción.

# short_description
source: The description must be at least 10 characters long.
es: La descripción debe tener al menos 10 caracteres.

# long_description
source: The description must be no more than 1000 characters long.
es: La descripción no debe tener más de 1000 caracteres.

# required_description
source: Description is required.
es: La descripción es obligatoria.

# required_radio_button
source: Please select one option.
es: Por favor seleccione una opción.

# required_file_upload
source: Please upload a file.
es: Por favor cargue un archivo.

# type_file_upload
source: Invalid file type. Allowed types are: JPG, JPEG, PNG, GIF, PDF, DOC, DOCX, TXT.
es: Tipo de archivo no válido. Tipos permitidos: JPG, JPEG, PNG, GIF, PDF, DOC, DOCX, TXT.

# size_file_upload
source: File size exceeds the limit of 5MB.
es: El tamaño del archivo supera el límite de 5 MB.

# functionality_not_implemented
source: The functionality you are trying to access is not yet implemented.
es: La funcionalidad a la que intenta acceder aún no está implementada.
